tap "ardupilot/px4"
tap "armmbed/formulae"
tap "clojure/tools"
tap "ctdk/ctdk"
tap "domq/gdb"
tap "dwarvesf/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "msoap/tools"
tap "nats-io/nats-tools"
tap "osrf/simulation"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "asio"
brew "boost"
brew "avrdude"
brew "bear"
brew "bsdmake"
brew "byacc"
brew "gettext"
brew "python-setuptools"
brew "cmake"
brew "compiledb"
brew "coreutils"
brew "cpputest"
brew "curaengine"
brew "d2"
brew "doctl"
brew "doxygen"
brew "dpkg"
brew "fakeroot"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gcc"
brew "libavif"
brew "gh"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "libheif"
brew "libtool"
brew "python@3.12"
brew "graphicsmagick"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "httrack"
brew "ical-buddy"
brew "imagemagick"
brew "openblas"
brew "ipopt"
brew "jq"
brew "lazygit"
brew "libmagic"
brew "libpcap"
brew "libpq"
brew "libssh2"
brew "lsusb"
brew "lynx"
brew "minicom"
brew "miniupnpc"
brew "ncftp"
brew "neofetch"
brew "neovim"
brew "netcat"
brew "ninja"
brew "nmap"
brew "nnn"
brew "open-ocd"
brew "openssl@1.1"
brew "pidof"
brew "pstree"
brew "pyenv"
brew "pygobject3"
brew "python@3.10"
brew "python-tk@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "ripgrep"
brew "socat"
brew "sox"
brew "starship"
brew "stlink"
brew "telnet"
brew "thefuck"
brew "tig"
brew "tmux"
brew "totp-cli"
brew "watch"
brew "websocketpp"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "ardupilot/px4/genromfs"
brew "clojure/tools/clojure"
brew "ctdk/ctdk/bsdgames-osx", link: false
brew "jandedobbeleer/oh-my-posh/oh-my-posh", link: false
brew "msoap/tools/shell2http"
brew "nats-io/nats-tools/nats"
brew "qmk/qmk/qmk"
cask "android-platform-tools"
cask "bruno"
cask "dbeaver-community"
cask "freecad"
cask "gcc-arm-embedded"
cask "hiddenbar"
cask "input-source-pro"
cask "lookaway"
cask "openscad"
cask "prince"
cask "qmk-toolbox"
cask "raycast"
cask "temurin"
cask "utm"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadalli.vscode-nginx-conf"
vscode "bradlc.vscode-tailwindcss"
vscode "cpylua.language-postcss"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "humao.rest-client"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "lakshits11.best-themes-redefined"
vscode "leathong.openscad-language-support"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "mufanza.e-ink-theme"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-czech"
vscode "svelte.svelte-vscode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "zh9528.file-size"
vscode "zhuangtongfa.material-theme"
